grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
#pragma once 

/* --- DFSDM1: Digital filter for sigma delta modulators ------------ */

/** @defgroup dfsdm1_registers Digital filter for sigma delta
      modulators Register
@{*/

/** DFSDM1_CHCFG0R1 channel configuration y register **/
#define DFSDM1_CHCFG0R1			MMIO32(DFSDM1_BASE + 0x00)
/** DFSDM1_CHCFG0R2 channel configuration y register **/
#define DFSDM1_CHCFG0R2			MMIO32(DFSDM1_BASE + 0x04)
/** DFSDM1_AWSCD0R analog watchdog and short-circuit detector register **/
#define DFSDM1_AWSCD0R			MMIO32(DFSDM1_BASE + 0x08)
/** DFSDM1_CHWDAT0R channel watchdog filter data register **/
#define DFSDM1_CHWDAT0R			MMIO32(DFSDM1_BASE + 0x0c)
/** DFSDM1_CHDATIN0R channel data input register **/
#define DFSDM1_CHDATIN0R			MMIO32(DFSDM1_BASE + 0x10)
/** DFSDM1_CHCFG1R1 CHCFG1R1 **/
#define DFSDM1_CHCFG1R1			MMIO32(DFSDM1_BASE + 0x20)
/** DFSDM1_CHCFG1R2 CHCFG1R2 **/
#define DFSDM1_CHCFG1R2			MMIO32(DFSDM1_BASE + 0x24)
/** DFSDM1_AWSCD1R AWSCD1R **/
#define DFSDM1_AWSCD1R			MMIO32(DFSDM1_BASE + 0x28)
/** DFSDM1_CHWDAT1R CHWDAT1R **/
#define DFSDM1_CHWDAT1R			MMIO32(DFSDM1_BASE + 0x2c)
/** DFSDM1_CHDATIN1R CHDATIN1R **/
#define DFSDM1_CHDATIN1R			MMIO32(DFSDM1_BASE + 0x30)
/** DFSDM1_CHCFG2R1 CHCFG2R1 **/
#define DFSDM1_CHCFG2R1			MMIO32(DFSDM1_BASE + 0x40)
/** DFSDM1_CHCFG2R2 CHCFG2R2 **/
#define DFSDM1_CHCFG2R2			MMIO32(DFSDM1_BASE + 0x44)
/** DFSDM1_AWSCD2R AWSCD2R **/
#define DFSDM1_AWSCD2R			MMIO32(DFSDM1_BASE + 0x48)
/** DFSDM1_CHWDAT2R CHWDAT2R **/
#define DFSDM1_CHWDAT2R			MMIO32(DFSDM1_BASE + 0x4c)
/** DFSDM1_CHDATIN2R CHDATIN2R **/
#define DFSDM1_CHDATIN2R			MMIO32(DFSDM1_BASE + 0x50)
/** DFSDM1_CHCFG3R1 CHCFG3R1 **/
#define DFSDM1_CHCFG3R1			MMIO32(DFSDM1_BASE + 0x60)
/** DFSDM1_CHCFG3R2 CHCFG3R2 **/
#define DFSDM1_CHCFG3R2			MMIO32(DFSDM1_BASE + 0x64)
/** DFSDM1_AWSCD3R AWSCD3R **/
#define DFSDM1_AWSCD3R			MMIO32(DFSDM1_BASE + 0x68)
/** DFSDM1_CHWDAT3R CHWDAT3R **/
#define DFSDM1_CHWDAT3R			MMIO32(DFSDM1_BASE + 0x6c)
/** DFSDM1_CHDATIN3R CHDATIN3R **/
#define DFSDM1_CHDATIN3R			MMIO32(DFSDM1_BASE + 0x70)
/** DFSDM1_CHCFG4R1 CHCFG4R1 **/
#define DFSDM1_CHCFG4R1			MMIO32(DFSDM1_BASE + 0x80)
/** DFSDM1_CHCFG4R2 CHCFG4R2 **/
#define DFSDM1_CHCFG4R2			MMIO32(DFSDM1_BASE + 0x84)
/** DFSDM1_AWSCD4R AWSCD4R **/
#define DFSDM1_AWSCD4R			MMIO32(DFSDM1_BASE + 0x88)
/** DFSDM1_CHWDAT4R CHWDAT4R **/
#define DFSDM1_CHWDAT4R			MMIO32(DFSDM1_BASE + 0x8c)
/** DFSDM1_CHDATIN4R CHDATIN4R **/
#define DFSDM1_CHDATIN4R			MMIO32(DFSDM1_BASE + 0x90)
/** DFSDM1_CHCFG5R1 CHCFG5R1 **/
#define DFSDM1_CHCFG5R1			MMIO32(DFSDM1_BASE + 0xa0)
/** DFSDM1_CHCFG5R2 CHCFG5R2 **/
#define DFSDM1_CHCFG5R2			MMIO32(DFSDM1_BASE + 0xa4)
/** DFSDM1_AWSCD5R AWSCD5R **/
#define DFSDM1_AWSCD5R			MMIO32(DFSDM1_BASE + 0xa8)
/** DFSDM1_CHWDAT5R CHWDAT5R **/
#define DFSDM1_CHWDAT5R			MMIO32(DFSDM1_BASE + 0xac)
/** DFSDM1_CHDATIN5R CHDATIN5R **/
#define DFSDM1_CHDATIN5R			MMIO32(DFSDM1_BASE + 0xb0)
/** DFSDM1_CHCFG6R1 CHCFG6R1 **/
#define DFSDM1_CHCFG6R1			MMIO32(DFSDM1_BASE + 0xc0)
/** DFSDM1_CHCFG6R2 CHCFG6R2 **/
#define DFSDM1_CHCFG6R2			MMIO32(DFSDM1_BASE + 0xc4)
/** DFSDM1_AWSCD6R AWSCD6R **/
#define DFSDM1_AWSCD6R			MMIO32(DFSDM1_BASE + 0xc8)
/** DFSDM1_CHWDAT6R CHWDAT6R **/
#define DFSDM1_CHWDAT6R			MMIO32(DFSDM1_BASE + 0xcc)
/** DFSDM1_CHDATIN6R CHDATIN6R **/
#define DFSDM1_CHDATIN6R			MMIO32(DFSDM1_BASE + 0xd0)
/** DFSDM1_CHCFG7R1 CHCFG7R1 **/
#define DFSDM1_CHCFG7R1			MMIO32(DFSDM1_BASE + 0xe0)
/** DFSDM1_CHCFG7R2 CHCFG7R2 **/
#define DFSDM1_CHCFG7R2			MMIO32(DFSDM1_BASE + 0xe4)
/** DFSDM1_AWSCD7R AWSCD7R **/
#define DFSDM1_AWSCD7R			MMIO32(DFSDM1_BASE + 0xe8)
/** DFSDM1_CHWDAT7R CHWDAT7R **/
#define DFSDM1_CHWDAT7R			MMIO32(DFSDM1_BASE + 0xec)
/** DFSDM1_CHDATIN7R CHDATIN7R **/
#define DFSDM1_CHDATIN7R			MMIO32(DFSDM1_BASE + 0xf0)
/** DFSDM1_DFSDM0_CR1 control register 1 **/
#define DFSDM1_DFSDM0_CR1			MMIO32(DFSDM1_BASE + 0x100)
/** DFSDM1_DFSDM0_CR2 control register 2 **/
#define DFSDM1_DFSDM0_CR2			MMIO32(DFSDM1_BASE + 0x104)
/** DFSDM1_DFSDM0_ISR interrupt and status register **/
#define DFSDM1_DFSDM0_ISR			MMIO32(DFSDM1_BASE + 0x108)
/** DFSDM1_DFSDM0_ICR interrupt flag clear register **/
#define DFSDM1_DFSDM0_ICR			MMIO32(DFSDM1_BASE + 0x10c)
/** DFSDM1_DFSDM0_JCHGR injected channel group selection register **/
#define DFSDM1_DFSDM0_JCHGR			MMIO32(DFSDM1_BASE + 0x110)
/** DFSDM1_DFSDM0_FCR filter control register **/
#define DFSDM1_DFSDM0_FCR			MMIO32(DFSDM1_BASE + 0x114)
/** DFSDM1_DFSDM0_JDATAR data register for injected group **/
#define DFSDM1_DFSDM0_JDATAR			MMIO32(DFSDM1_BASE + 0x118)
/** DFSDM1_DFSDM0_RDATAR data register for the regular channel **/
#define DFSDM1_DFSDM0_RDATAR			MMIO32(DFSDM1_BASE + 0x11c)
/** DFSDM1_DFSDM0_AWHTR analog watchdog high threshold register **/
#define DFSDM1_DFSDM0_AWHTR			MMIO32(DFSDM1_BASE + 0x120)
/** DFSDM1_DFSDM0_AWLTR analog watchdog low threshold register **/
#define DFSDM1_DFSDM0_AWLTR			MMIO32(DFSDM1_BASE + 0x124)
/** DFSDM1_DFSDM0_AWSR analog watchdog status register **/
#define DFSDM1_DFSDM0_AWSR			MMIO32(DFSDM1_BASE + 0x128)
/** DFSDM1_DFSDM0_AWCFR analog watchdog clear flag register **/
#define DFSDM1_DFSDM0_AWCFR			MMIO32(DFSDM1_BASE + 0x12c)
/** DFSDM1_DFSDM0_EXMAX Extremes detector maximum register **/
#define DFSDM1_DFSDM0_EXMAX			MMIO32(DFSDM1_BASE + 0x130)
/** DFSDM1_DFSDM0_EXMIN Extremes detector minimum register **/
#define DFSDM1_DFSDM0_EXMIN			MMIO32(DFSDM1_BASE + 0x134)
/** DFSDM1_DFSDM0_CNVTIMR conversion timer register **/
#define DFSDM1_DFSDM0_CNVTIMR			MMIO32(DFSDM1_BASE + 0x138)
/** DFSDM1_DFSDM1_CR1 control register 1 **/
#define DFSDM1_DFSDM1_CR1			MMIO32(DFSDM1_BASE + 0x200)
/** DFSDM1_DFSDM1_CR2 control register 2 **/
#define DFSDM1_DFSDM1_CR2			MMIO32(DFSDM1_BASE + 0x204)
/** DFSDM1_DFSDM1_ISR interrupt and status register **/
#define DFSDM1_DFSDM1_ISR			MMIO32(DFSDM1_BASE + 0x208)
/** DFSDM1_DFSDM1_ICR interrupt flag clear register **/
#define DFSDM1_DFSDM1_ICR			MMIO32(DFSDM1_BASE + 0x20c)
/** DFSDM1_DFSDM1_JCHGR injected channel group selection register **/
#define DFSDM1_DFSDM1_JCHGR			MMIO32(DFSDM1_BASE + 0x210)
/** DFSDM1_DFSDM1_FCR filter control register **/
#define DFSDM1_DFSDM1_FCR			MMIO32(DFSDM1_BASE + 0x214)
/** DFSDM1_DFSDM1_JDATAR data register for injected group **/
#define DFSDM1_DFSDM1_JDATAR			MMIO32(DFSDM1_BASE + 0x218)
/** DFSDM1_DFSDM1_RDATAR data register for the regular channel **/
#define DFSDM1_DFSDM1_RDATAR			MMIO32(DFSDM1_BASE + 0x21c)
/** DFSDM1_DFSDM1_AWHTR analog watchdog high threshold register **/
#define DFSDM1_DFSDM1_AWHTR			MMIO32(DFSDM1_BASE + 0x220)
/** DFSDM1_DFSDM1_AWLTR analog watchdog low threshold register **/
#define DFSDM1_DFSDM1_AWLTR			MMIO32(DFSDM1_BASE + 0x224)
/** DFSDM1_DFSDM1_AWSR analog watchdog status register **/
#define DFSDM1_DFSDM1_AWSR			MMIO32(DFSDM1_BASE + 0x228)
/** DFSDM1_DFSDM1_AWCFR analog watchdog clear flag register **/
#define DFSDM1_DFSDM1_AWCFR			MMIO32(DFSDM1_BASE + 0x22c)
/** DFSDM1_DFSDM1_EXMAX Extremes detector maximum register **/
#define DFSDM1_DFSDM1_EXMAX			MMIO32(DFSDM1_BASE + 0x230)
/** DFSDM1_DFSDM1_EXMIN Extremes detector minimum register **/
#define DFSDM1_DFSDM1_EXMIN			MMIO32(DFSDM1_BASE + 0x234)
/** DFSDM1_DFSDM1_CNVTIMR conversion timer register **/
#define DFSDM1_DFSDM1_CNVTIMR			MMIO32(DFSDM1_BASE + 0x238)
/** DFSDM1_DFSDM2_CR1 control register 1 **/
#define DFSDM1_DFSDM2_CR1			MMIO32(DFSDM1_BASE + 0x300)
/** DFSDM1_DFSDM2_CR2 control register 2 **/
#define DFSDM1_DFSDM2_CR2			MMIO32(DFSDM1_BASE + 0x304)
/** DFSDM1_DFSDM2_ISR interrupt and status register **/
#define DFSDM1_DFSDM2_ISR			MMIO32(DFSDM1_BASE + 0x308)
/** DFSDM1_DFSDM2_ICR interrupt flag clear register **/
#define DFSDM1_DFSDM2_ICR			MMIO32(DFSDM1_BASE + 0x30c)
/** DFSDM1_DFSDM2_JCHGR injected channel group selection register **/
#define DFSDM1_DFSDM2_JCHGR			MMIO32(DFSDM1_BASE + 0x310)
/** DFSDM1_DFSDM2_FCR filter control register **/
#define DFSDM1_DFSDM2_FCR			MMIO32(DFSDM1_BASE + 0x314)
/** DFSDM1_DFSDM2_JDATAR data register for injected group **/
#define DFSDM1_DFSDM2_JDATAR			MMIO32(DFSDM1_BASE + 0x318)
/** DFSDM1_DFSDM2_RDATAR data register for the regular channel **/
#define DFSDM1_DFSDM2_RDATAR			MMIO32(DFSDM1_BASE + 0x31c)
/** DFSDM1_DFSDM2_AWHTR analog watchdog high threshold register **/
#define DFSDM1_DFSDM2_AWHTR			MMIO32(DFSDM1_BASE + 0x320)
/** DFSDM1_DFSDM2_AWLTR analog watchdog low threshold register **/
#define DFSDM1_DFSDM2_AWLTR			MMIO32(DFSDM1_BASE + 0x324)
/** DFSDM1_DFSDM2_AWSR analog watchdog status register **/
#define DFSDM1_DFSDM2_AWSR			MMIO32(DFSDM1_BASE + 0x328)
/** DFSDM1_DFSDM2_AWCFR analog watchdog clear flag register **/
#define DFSDM1_DFSDM2_AWCFR			MMIO32(DFSDM1_BASE + 0x32c)
/** DFSDM1_DFSDM2_EXMAX Extremes detector maximum register **/
#define DFSDM1_DFSDM2_EXMAX			MMIO32(DFSDM1_BASE + 0x330)
/** DFSDM1_DFSDM2_EXMIN Extremes detector minimum register **/
#define DFSDM1_DFSDM2_EXMIN			MMIO32(DFSDM1_BASE + 0x334)
/** DFSDM1_DFSDM2_CNVTIMR conversion timer register **/
#define DFSDM1_DFSDM2_CNVTIMR			MMIO32(DFSDM1_BASE + 0x338)
/** DFSDM1_DFSDM3_CR1 control register 1 **/
#define DFSDM1_DFSDM3_CR1			MMIO32(DFSDM1_BASE + 0x400)
/** DFSDM1_DFSDM3_CR2 control register 2 **/
#define DFSDM1_DFSDM3_CR2			MMIO32(DFSDM1_BASE + 0x404)
/** DFSDM1_DFSDM3_ISR interrupt and status register **/
#define DFSDM1_DFSDM3_ISR			MMIO32(DFSDM1_BASE + 0x408)
/** DFSDM1_DFSDM3_ICR interrupt flag clear register **/
#define DFSDM1_DFSDM3_ICR			MMIO32(DFSDM1_BASE + 0x40c)
/** DFSDM1_DFSDM3_JCHGR injected channel group selection register **/
#define DFSDM1_DFSDM3_JCHGR			MMIO32(DFSDM1_BASE + 0x410)
/** DFSDM1_DFSDM3_FCR filter control register **/
#define DFSDM1_DFSDM3_FCR			MMIO32(DFSDM1_BASE + 0x414)
/** DFSDM1_DFSDM3_JDATAR data register for injected group **/
#define DFSDM1_DFSDM3_JDATAR			MMIO32(DFSDM1_BASE + 0x418)
/** DFSDM1_DFSDM3_RDATAR data register for the regular channel **/
#define DFSDM1_DFSDM3_RDATAR			MMIO32(DFSDM1_BASE + 0x41c)
/** DFSDM1_DFSDM3_AWHTR analog watchdog high threshold register **/
#define DFSDM1_DFSDM3_AWHTR			MMIO32(DFSDM1_BASE + 0x420)
/** DFSDM1_DFSDM3_AWLTR analog watchdog low threshold register **/
#define DFSDM1_DFSDM3_AWLTR			MMIO32(DFSDM1_BASE + 0x424)
/** DFSDM1_DFSDM3_AWSR analog watchdog status register **/
#define DFSDM1_DFSDM3_AWSR			MMIO32(DFSDM1_BASE + 0x428)
/** DFSDM1_DFSDM3_AWCFR analog watchdog clear flag register **/
#define DFSDM1_DFSDM3_AWCFR			MMIO32(DFSDM1_BASE + 0x42c)
/** DFSDM1_DFSDM3_EXMAX Extremes detector maximum register **/
#define DFSDM1_DFSDM3_EXMAX			MMIO32(DFSDM1_BASE + 0x430)
/** DFSDM1_DFSDM3_EXMIN Extremes detector minimum register **/
#define DFSDM1_DFSDM3_EXMIN			MMIO32(DFSDM1_BASE + 0x434)
/** DFSDM1_DFSDM3_CNVTIMR conversion timer register **/
#define DFSDM1_DFSDM3_CNVTIMR			MMIO32(DFSDM1_BASE + 0x438)

/**@}*/


/** @defgroup dfsdm1_chcfg0r1 CHCFG0R1 channel configuration y register
@{*/

/** DFSDM1_CHCFG0R1_DFSDMEN DFSDMEN **/
#define DFSDM1_CHCFG0R1_DFSDMEN		(1 << 31)
/** DFSDM1_CHCFG0R1_CKOUTSRC CKOUTSRC **/
#define DFSDM1_CHCFG0R1_CKOUTSRC		(1 << 30)

#define DFSDM1_CHCFG0R1_CKOUTDIV_SHIFT		16
#define DFSDM1_CHCFG0R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm1_chcfg0r1_ckoutdiv CKOUTDIV CKOUTDIV
@{*/
/**@}*/


#define DFSDM1_CHCFG0R1_DATPACK_SHIFT		14
#define DFSDM1_CHCFG0R1_DATPACK_MASK		0x03
/** @defgroup dfsdm1_chcfg0r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM1_CHCFG0R1_DATMPX_SHIFT		12
#define DFSDM1_CHCFG0R1_DATMPX_MASK		0x03
/** @defgroup dfsdm1_chcfg0r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

