grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
/** DFSDM1_CHCFG0R1_CHINSEL CHINSEL **/
#define DFSDM1_CHCFG0R1_CHINSEL		(1 << 8)
/** DFSDM1_CHCFG0R1_CHEN CHEN **/
#define DFSDM1_CHCFG0R1_CHEN		(1 << 7)
/** DFSDM1_CHCFG0R1_CKABEN CKABEN **/
#define DFSDM1_CHCFG0R1_CKABEN		(1 << 6)
/** DFSDM1_CHCFG0R1_SCDEN SCDEN **/
#define DFSDM1_CHCFG0R1_SCDEN		(1 << 5)

#define DFSDM1_CHCFG0R1_SPICKSEL_SHIFT		2
#define DFSDM1_CHCFG0R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm1_chcfg0r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM1_CHCFG0R1_SITP_SHIFT		0
#define DFSDM1_CHCFG0R1_SITP_MASK		0x03
/** @defgroup dfsdm1_chcfg0r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chcfg0r2 CHCFG0R2 channel configuration y register
@{*/


#define DFSDM1_CHCFG0R2_OFFSET_SHIFT		8
#define DFSDM1_CHCFG0R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_chcfg0r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CHCFG0R2_DTRBS_SHIFT		3
#define DFSDM1_CHCFG0R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_chcfg0r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_awscd0r AWSCD0R analog watchdog and short-circuit detector register
@{*/


#define DFSDM1_AWSCD0R_AWFORD_SHIFT		22
#define DFSDM1_AWSCD0R_AWFORD_MASK		0x03
/** @defgroup dfsdm1_awscd0r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_AWSCD0R_AWFOSR_SHIFT		16
#define DFSDM1_AWSCD0R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_awscd0r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_AWSCD0R_BKSCD_SHIFT		12
#define DFSDM1_AWSCD0R_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_awscd0r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM1_AWSCD0R_SCDT_SHIFT		0
#define DFSDM1_AWSCD0R_SCDT_MASK		0xff
/** @defgroup dfsdm1_awscd0r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chwdat0r CHWDAT0R channel watchdog filter data register
@{*/


#define DFSDM1_CHWDAT0R_WDATA_SHIFT		0
#define DFSDM1_CHWDAT0R_WDATA_MASK		0xffff
/** @defgroup dfsdm1_chwdat0r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chdatin0r CHDATIN0R channel data input register
@{*/


#define DFSDM1_CHDATIN0R_INDAT1_SHIFT		16
#define DFSDM1_CHDATIN0R_INDAT1_MASK		0xffff
/** @defgroup dfsdm1_chdatin0r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM1_CHDATIN0R_INDAT0_SHIFT		0
#define DFSDM1_CHDATIN0R_INDAT0_MASK		0xffff
/** @defgroup dfsdm1_chdatin0r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chcfg1r1 CHCFG1R1 CHCFG1R1
@{*/


#define DFSDM1_CHCFG1R1_DATPACK_SHIFT		14
#define DFSDM1_CHCFG1R1_DATPACK_MASK		0x03
/** @defgroup dfsdm1_chcfg1r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM1_CHCFG1R1_DATMPX_SHIFT		12
#define DFSDM1_CHCFG1R1_DATMPX_MASK		0x03
/** @defgroup dfsdm1_chcfg1r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM1_CHCFG1R1_CHINSEL CHINSEL **/
#define DFSDM1_CHCFG1R1_CHINSEL		(1 << 8)
/** DFSDM1_CHCFG1R1_CHEN CHEN **/
#define DFSDM1_CHCFG1R1_CHEN		(1 << 7)
/** DFSDM1_CHCFG1R1_CKABEN CKABEN **/
#define DFSDM1_CHCFG1R1_CKABEN		(1 << 6)
/** DFSDM1_CHCFG1R1_SCDEN SCDEN **/
#define DFSDM1_CHCFG1R1_SCDEN		(1 << 5)

#define DFSDM1_CHCFG1R1_SPICKSEL_SHIFT		2
#define DFSDM1_CHCFG1R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm1_chcfg1r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM1_CHCFG1R1_SITP_SHIFT		0
#define DFSDM1_CHCFG1R1_SITP_MASK		0x03
/** @defgroup dfsdm1_chcfg1r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chcfg1r2 CHCFG1R2 CHCFG1R2
@{*/


#define DFSDM1_CHCFG1R2_OFFSET_SHIFT		8
#define DFSDM1_CHCFG1R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_chcfg1r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CHCFG1R2_DTRBS_SHIFT		3
#define DFSDM1_CHCFG1R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_chcfg1r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_awscd1r AWSCD1R AWSCD1R
@{*/


#define DFSDM1_AWSCD1R_AWFORD_SHIFT		22
#define DFSDM1_AWSCD1R_AWFORD_MASK		0x03
/** @defgroup dfsdm1_awscd1r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_AWSCD1R_AWFOSR_SHIFT		16
#define DFSDM1_AWSCD1R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_awscd1r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_AWSCD1R_BKSCD_SHIFT		12
#define DFSDM1_AWSCD1R_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_awscd1r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM1_AWSCD1R_SCDT_SHIFT		0
#define DFSDM1_AWSCD1R_SCDT_MASK		0xff
/** @defgroup dfsdm1_awscd1r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chwdat1r CHWDAT1R CHWDAT1R
@{*/


#define DFSDM1_CHWDAT1R_WDATA_SHIFT		0
#define DFSDM1_CHWDAT1R_WDATA_MASK		0xffff
/** @defgroup dfsdm1_chwdat1r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chdatin1r CHDATIN1R CHDATIN1R
@{*/


#define DFSDM1_CHDATIN1R_INDAT1_SHIFT		16
#define DFSDM1_CHDATIN1R_INDAT1_MASK		0xffff
/** @defgroup dfsdm1_chdatin1r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM1_CHDATIN1R_INDAT0_SHIFT		0
#define DFSDM1_CHDATIN1R_INDAT0_MASK		0xffff
/** @defgroup dfsdm1_chdatin1r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chcfg2r1 CHCFG2R1 CHCFG2R1
@{*/


#define DFSDM1_CHCFG2R1_DATPACK_SHIFT		14
#define DFSDM1_CHCFG2R1_DATPACK_MASK		0x03
/** @defgroup dfsdm1_chcfg2r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM1_CHCFG2R1_DATMPX_SHIFT		12
#define DFSDM1_CHCFG2R1_DATMPX_MASK		0x03
/** @defgroup dfsdm1_chcfg2r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM1_CHCFG2R1_CHINSEL CHINSEL **/
#define DFSDM1_CHCFG2R1_CHINSEL		(1 << 8)
/** DFSDM1_CHCFG2R1_CHEN CHEN **/
#define DFSDM1_CHCFG2R1_CHEN		(1 << 7)
/** DFSDM1_CHCFG2R1_CKABEN CKABEN **/
#define DFSDM1_CHCFG2R1_CKABEN		(1 << 6)
/** DFSDM1_CHCFG2R1_SCDEN SCDEN **/
#define DFSDM1_CHCFG2R1_SCDEN		(1 << 5)

#define DFSDM1_CHCFG2R1_SPICKSEL_SHIFT		2
#define DFSDM1_CHCFG2R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm1_chcfg2r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM1_CHCFG2R1_SITP_SHIFT		0
#define DFSDM1_CHCFG2R1_SITP_MASK		0x03
/** @defgroup dfsdm1_chcfg2r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_chcfg2r2 CHCFG2R2 CHCFG2R2
@{*/


#define DFSDM1_CHCFG2R2_OFFSET_SHIFT		8
#define DFSDM1_CHCFG2R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_chcfg2r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CHCFG2R2_DTRBS_SHIFT		3
#define DFSDM1_CHCFG2R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_chcfg2r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

