grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
/** DFSDM1_DFSDM0_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM1_DFSDM0_ICR_CLRROVRF		(1 << 3)
/** DFSDM1_DFSDM0_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM1_DFSDM0_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm1_dfsdm0_jchgr DFSDM0JCHGR injected channel group selection register
@{*/


#define DFSDM1_DFSDM0_JCHGR_JCHG_SHIFT		0
#define DFSDM1_DFSDM0_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_fcr DFSDM0FCR filter control register
@{*/


#define DFSDM1_DFSDM0_FCR_FORD_SHIFT		29
#define DFSDM1_DFSDM0_FCR_FORD_MASK		0x07
/** @defgroup dfsdm1_dfsdm0_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM1_DFSDM0_FCR_FOSR_SHIFT		16
#define DFSDM1_DFSDM0_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm1_dfsdm0_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM1_DFSDM0_FCR_IOSR_SHIFT		0
#define DFSDM1_DFSDM0_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_jdatar DFSDM0JDATAR data register for injected group
@{*/


#define DFSDM1_DFSDM0_JDATAR_JDATA_SHIFT		8
#define DFSDM1_DFSDM0_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM1_DFSDM0_JDATAR_JDATACH_SHIFT		0
#define DFSDM1_DFSDM0_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm0_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_rdatar DFSDM0RDATAR data register for the regular channel
@{*/


#define DFSDM1_DFSDM0_RDATAR_RDATA_SHIFT		8
#define DFSDM1_DFSDM0_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM1_DFSDM0_RDATAR_RPEND Regular channel pending data **/
#define DFSDM1_DFSDM0_RDATAR_RPEND		(1 << 4)

#define DFSDM1_DFSDM0_RDATAR_RDATACH_SHIFT		0
#define DFSDM1_DFSDM0_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm0_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_awhtr DFSDM0AWHTR analog watchdog high threshold register
@{*/


#define DFSDM1_DFSDM0_AWHTR_AWHT_SHIFT		8
#define DFSDM1_DFSDM0_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM0_AWHTR_BKAWH_SHIFT		0
#define DFSDM1_DFSDM0_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm1_dfsdm0_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_awltr DFSDM0AWLTR analog watchdog low threshold register
@{*/


#define DFSDM1_DFSDM0_AWLTR_AWLT_SHIFT		8
#define DFSDM1_DFSDM0_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM0_AWLTR_BKAWL_SHIFT		0
#define DFSDM1_DFSDM0_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm1_dfsdm0_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_awsr DFSDM0AWSR analog watchdog status register
@{*/


#define DFSDM1_DFSDM0_AWSR_AWHTF_SHIFT		8
#define DFSDM1_DFSDM0_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM0_AWSR_AWLTF_SHIFT		0
#define DFSDM1_DFSDM0_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_awcfr DFSDM0AWCFR analog watchdog clear flag register
@{*/


#define DFSDM1_DFSDM0_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM1_DFSDM0_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM0_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM1_DFSDM0_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm0_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_exmax DFSDM0EXMAX Extremes detector maximum register
@{*/


#define DFSDM1_DFSDM0_EXMAX_EXMAX_SHIFT		8
#define DFSDM1_DFSDM0_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM1_DFSDM0_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM1_DFSDM0_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm0_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_exmin DFSDM0EXMIN Extremes detector minimum register
@{*/


#define DFSDM1_DFSDM0_EXMIN_EXMIN_SHIFT		8
#define DFSDM1_DFSDM0_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm0_exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM1_DFSDM0_EXMIN_EXMINCH_SHIFT		0
#define DFSDM1_DFSDM0_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm0_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm0_cnvtimr DFSDM0CNVTIMR conversion timer register
@{*/


#define DFSDM1_DFSDM0_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM1_DFSDM0_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm1_dfsdm0_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_cr1 DFSDM1CR1 control register 1
@{*/

/** DFSDM1_DFSDM1_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM1_DFSDM1_CR1_AWFSEL		(1 << 30)
/** DFSDM1_DFSDM1_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM1_DFSDM1_CR1_FAST		(1 << 29)

#define DFSDM1_DFSDM1_CR1_RCH_SHIFT		24
#define DFSDM1_DFSDM1_CR1_RCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM1_DFSDM1_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM1_DFSDM1_CR1_RDMAEN		(1 << 21)
/** DFSDM1_DFSDM1_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM1_DFSDM1_CR1_RSYNC		(1 << 19)
/** DFSDM1_DFSDM1_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM1_DFSDM1_CR1_RCONT		(1 << 18)
/** DFSDM1_DFSDM1_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM1_DFSDM1_CR1_RSWSTART		(1 << 17)

