grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
#define DFSDM1_DFSDM1_CR1_JEXTEN_SHIFT		13
#define DFSDM1_DFSDM1_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm1_dfsdm1_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM1_DFSDM1_CR1_JEXTSEL_SHIFT		8
#define DFSDM1_DFSDM1_CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM1_DFSDM1_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM1_DFSDM1_CR1_JDMAEN		(1 << 5)
/** DFSDM1_DFSDM1_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM1_DFSDM1_CR1_JSCAN		(1 << 4)
/** DFSDM1_DFSDM1_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM1_DFSDM1_CR1_JSYNC		(1 << 3)
/** DFSDM1_DFSDM1_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM1_DFSDM1_CR1_JSWSTART		(1 << 1)
/** DFSDM1_DFSDM1_CR1_DFEN DFSDM enable **/
#define DFSDM1_DFSDM1_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm1_cr2 DFSDM1CR2 control register 2
@{*/


#define DFSDM1_DFSDM1_CR2_AWDCH_SHIFT		16
#define DFSDM1_DFSDM1_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM1_DFSDM1_CR2_EXCH_SHIFT		8
#define DFSDM1_DFSDM1_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM1_DFSDM1_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM1_DFSDM1_CR2_CKABIE		(1 << 6)
/** DFSDM1_DFSDM1_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM1_DFSDM1_CR2_SCDIE		(1 << 5)
/** DFSDM1_DFSDM1_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM1_DFSDM1_CR2_AWDIE		(1 << 4)
/** DFSDM1_DFSDM1_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM1_DFSDM1_CR2_ROVRIE		(1 << 3)
/** DFSDM1_DFSDM1_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM1_DFSDM1_CR2_JOVRIE		(1 << 2)
/** DFSDM1_DFSDM1_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM1_DFSDM1_CR2_REOCIE		(1 << 1)
/** DFSDM1_DFSDM1_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM1_DFSDM1_CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm1_isr DFSDM1ISR interrupt and status register
@{*/


#define DFSDM1_DFSDM1_ISR_SCDF_SHIFT		24
#define DFSDM1_DFSDM1_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_DFSDM1_ISR_CKABF_SHIFT		16
#define DFSDM1_DFSDM1_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM1_DFSDM1_ISR_RCIP Regular conversion in progress status **/
#define DFSDM1_DFSDM1_ISR_RCIP		(1 << 14)
/** DFSDM1_DFSDM1_ISR_JCIP Injected conversion in progress status **/
#define DFSDM1_DFSDM1_ISR_JCIP		(1 << 13)
/** DFSDM1_DFSDM1_ISR_AWDF Analog watchdog **/
#define DFSDM1_DFSDM1_ISR_AWDF		(1 << 4)
/** DFSDM1_DFSDM1_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM1_DFSDM1_ISR_ROVRF		(1 << 3)
/** DFSDM1_DFSDM1_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM1_DFSDM1_ISR_JOVRF		(1 << 2)
/** DFSDM1_DFSDM1_ISR_REOCF End of regular conversion flag **/
#define DFSDM1_DFSDM1_ISR_REOCF		(1 << 1)
/** DFSDM1_DFSDM1_ISR_JEOCF End of injected conversion flag **/
#define DFSDM1_DFSDM1_ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm1_icr DFSDM1ICR interrupt flag clear register
@{*/


#define DFSDM1_DFSDM1_ICR_CLRSCDF_SHIFT		24
#define DFSDM1_DFSDM1_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_DFSDM1_ICR_CLRCKABF_SHIFT		16
#define DFSDM1_DFSDM1_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM1_DFSDM1_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM1_DFSDM1_ICR_CLRROVRF		(1 << 3)
/** DFSDM1_DFSDM1_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM1_DFSDM1_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm1_dfsdm1_jchgr DFSDM1JCHGR injected channel group selection register
@{*/


#define DFSDM1_DFSDM1_JCHGR_JCHG_SHIFT		0
#define DFSDM1_DFSDM1_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_fcr DFSDM1FCR filter control register
@{*/


#define DFSDM1_DFSDM1_FCR_FORD_SHIFT		29
#define DFSDM1_DFSDM1_FCR_FORD_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM1_DFSDM1_FCR_FOSR_SHIFT		16
#define DFSDM1_DFSDM1_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm1_dfsdm1_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM1_DFSDM1_FCR_IOSR_SHIFT		0
#define DFSDM1_DFSDM1_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_jdatar DFSDM1JDATAR data register for injected group
@{*/


#define DFSDM1_DFSDM1_JDATAR_JDATA_SHIFT		8
#define DFSDM1_DFSDM1_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM1_DFSDM1_JDATAR_JDATACH_SHIFT		0
#define DFSDM1_DFSDM1_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_rdatar DFSDM1RDATAR data register for the regular channel
@{*/


#define DFSDM1_DFSDM1_RDATAR_RDATA_SHIFT		8
#define DFSDM1_DFSDM1_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM1_DFSDM1_RDATAR_RPEND Regular channel pending data **/
#define DFSDM1_DFSDM1_RDATAR_RPEND		(1 << 4)

#define DFSDM1_DFSDM1_RDATAR_RDATACH_SHIFT		0
#define DFSDM1_DFSDM1_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_awhtr DFSDM1AWHTR analog watchdog high threshold register
@{*/


