grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
#define DFSDM1_DFSDM1_AWHTR_AWHT_SHIFT		8
#define DFSDM1_DFSDM1_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM1_AWHTR_BKAWH_SHIFT		0
#define DFSDM1_DFSDM1_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm1_dfsdm1_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_awltr DFSDM1AWLTR analog watchdog low threshold register
@{*/


#define DFSDM1_DFSDM1_AWLTR_AWLT_SHIFT		8
#define DFSDM1_DFSDM1_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM1_AWLTR_BKAWL_SHIFT		0
#define DFSDM1_DFSDM1_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm1_dfsdm1_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_awsr DFSDM1AWSR analog watchdog status register
@{*/


#define DFSDM1_DFSDM1_AWSR_AWHTF_SHIFT		8
#define DFSDM1_DFSDM1_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM1_AWSR_AWLTF_SHIFT		0
#define DFSDM1_DFSDM1_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_awcfr DFSDM1AWCFR analog watchdog clear flag register
@{*/


#define DFSDM1_DFSDM1_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM1_DFSDM1_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM1_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM1_DFSDM1_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm1_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_exmax DFSDM1EXMAX Extremes detector maximum register
@{*/


#define DFSDM1_DFSDM1_EXMAX_EXMAX_SHIFT		8
#define DFSDM1_DFSDM1_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM1_DFSDM1_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM1_DFSDM1_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_exmin DFSDM1EXMIN Extremes detector minimum register
@{*/


#define DFSDM1_DFSDM1_EXMIN_EXMIN_SHIFT		8
#define DFSDM1_DFSDM1_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm1_exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM1_DFSDM1_EXMIN_EXMINCH_SHIFT		0
#define DFSDM1_DFSDM1_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm1_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm1_cnvtimr DFSDM1CNVTIMR conversion timer register
@{*/


#define DFSDM1_DFSDM1_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM1_DFSDM1_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm1_dfsdm1_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_cr1 DFSDM2CR1 control register 1
@{*/

/** DFSDM1_DFSDM2_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM1_DFSDM2_CR1_AWFSEL		(1 << 30)
/** DFSDM1_DFSDM2_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM1_DFSDM2_CR1_FAST		(1 << 29)

#define DFSDM1_DFSDM2_CR1_RCH_SHIFT		24
#define DFSDM1_DFSDM2_CR1_RCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM1_DFSDM2_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM1_DFSDM2_CR1_RDMAEN		(1 << 21)
/** DFSDM1_DFSDM2_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM1_DFSDM2_CR1_RSYNC		(1 << 19)
/** DFSDM1_DFSDM2_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM1_DFSDM2_CR1_RCONT		(1 << 18)
/** DFSDM1_DFSDM2_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM1_DFSDM2_CR1_RSWSTART		(1 << 17)

#define DFSDM1_DFSDM2_CR1_JEXTEN_SHIFT		13
#define DFSDM1_DFSDM2_CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm1_dfsdm2_cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM1_DFSDM2_CR1_JEXTSEL_SHIFT		8
#define DFSDM1_DFSDM2_CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM1_DFSDM2_CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM1_DFSDM2_CR1_JDMAEN		(1 << 5)
/** DFSDM1_DFSDM2_CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM1_DFSDM2_CR1_JSCAN		(1 << 4)
/** DFSDM1_DFSDM2_CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM1_DFSDM2_CR1_JSYNC		(1 << 3)
/** DFSDM1_DFSDM2_CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM1_DFSDM2_CR1_JSWSTART		(1 << 1)
/** DFSDM1_DFSDM2_CR1_DFEN DFSDM enable **/
#define DFSDM1_DFSDM2_CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm2_cr2 DFSDM2CR2 control register 2
@{*/


#define DFSDM1_DFSDM2_CR2_AWDCH_SHIFT		16
#define DFSDM1_DFSDM2_CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM1_DFSDM2_CR2_EXCH_SHIFT		8
#define DFSDM1_DFSDM2_CR2_EXCH_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM1_DFSDM2_CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM1_DFSDM2_CR2_CKABIE		(1 << 6)
/** DFSDM1_DFSDM2_CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM1_DFSDM2_CR2_SCDIE		(1 << 5)
/** DFSDM1_DFSDM2_CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM1_DFSDM2_CR2_AWDIE		(1 << 4)
/** DFSDM1_DFSDM2_CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM1_DFSDM2_CR2_ROVRIE		(1 << 3)
/** DFSDM1_DFSDM2_CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM1_DFSDM2_CR2_JOVRIE		(1 << 2)
/** DFSDM1_DFSDM2_CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM1_DFSDM2_CR2_REOCIE		(1 << 1)
/** DFSDM1_DFSDM2_CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM1_DFSDM2_CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm2_isr DFSDM2ISR interrupt and status register
@{*/


