grevaillot/svd_tools/headers/STM32L4R7/dfsdm1.h
#define DFSDM1_DFSDM2_ISR_SCDF_SHIFT		24
#define DFSDM1_DFSDM2_ISR_SCDF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_DFSDM2_ISR_CKABF_SHIFT		16
#define DFSDM1_DFSDM2_ISR_CKABF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM1_DFSDM2_ISR_RCIP Regular conversion in progress status **/
#define DFSDM1_DFSDM2_ISR_RCIP		(1 << 14)
/** DFSDM1_DFSDM2_ISR_JCIP Injected conversion in progress status **/
#define DFSDM1_DFSDM2_ISR_JCIP		(1 << 13)
/** DFSDM1_DFSDM2_ISR_AWDF Analog watchdog **/
#define DFSDM1_DFSDM2_ISR_AWDF		(1 << 4)
/** DFSDM1_DFSDM2_ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM1_DFSDM2_ISR_ROVRF		(1 << 3)
/** DFSDM1_DFSDM2_ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM1_DFSDM2_ISR_JOVRF		(1 << 2)
/** DFSDM1_DFSDM2_ISR_REOCF End of regular conversion flag **/
#define DFSDM1_DFSDM2_ISR_REOCF		(1 << 1)
/** DFSDM1_DFSDM2_ISR_JEOCF End of injected conversion flag **/
#define DFSDM1_DFSDM2_ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_dfsdm2_icr DFSDM2ICR interrupt flag clear register
@{*/


#define DFSDM1_DFSDM2_ICR_CLRSCDF_SHIFT		24
#define DFSDM1_DFSDM2_ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_DFSDM2_ICR_CLRCKABF_SHIFT		16
#define DFSDM1_DFSDM2_ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM1_DFSDM2_ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM1_DFSDM2_ICR_CLRROVRF		(1 << 3)
/** DFSDM1_DFSDM2_ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM1_DFSDM2_ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm1_dfsdm2_jchgr DFSDM2JCHGR injected channel group selection register
@{*/


#define DFSDM1_DFSDM2_JCHGR_JCHG_SHIFT		0
#define DFSDM1_DFSDM2_JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_fcr DFSDM2FCR filter control register
@{*/


#define DFSDM1_DFSDM2_FCR_FORD_SHIFT		29
#define DFSDM1_DFSDM2_FCR_FORD_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM1_DFSDM2_FCR_FOSR_SHIFT		16
#define DFSDM1_DFSDM2_FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm1_dfsdm2_fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM1_DFSDM2_FCR_IOSR_SHIFT		0
#define DFSDM1_DFSDM2_FCR_IOSR_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_jdatar DFSDM2JDATAR data register for injected group
@{*/


#define DFSDM1_DFSDM2_JDATAR_JDATA_SHIFT		8
#define DFSDM1_DFSDM2_JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM1_DFSDM2_JDATAR_JDATACH_SHIFT		0
#define DFSDM1_DFSDM2_JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_rdatar DFSDM2RDATAR data register for the regular channel
@{*/


#define DFSDM1_DFSDM2_RDATAR_RDATA_SHIFT		8
#define DFSDM1_DFSDM2_RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM1_DFSDM2_RDATAR_RPEND Regular channel pending data **/
#define DFSDM1_DFSDM2_RDATAR_RPEND		(1 << 4)

#define DFSDM1_DFSDM2_RDATAR_RDATACH_SHIFT		0
#define DFSDM1_DFSDM2_RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_awhtr DFSDM2AWHTR analog watchdog high threshold register
@{*/


#define DFSDM1_DFSDM2_AWHTR_AWHT_SHIFT		8
#define DFSDM1_DFSDM2_AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM2_AWHTR_BKAWH_SHIFT		0
#define DFSDM1_DFSDM2_AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm1_dfsdm2_awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_awltr DFSDM2AWLTR analog watchdog low threshold register
@{*/


#define DFSDM1_DFSDM2_AWLTR_AWLT_SHIFT		8
#define DFSDM1_DFSDM2_AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM1_DFSDM2_AWLTR_BKAWL_SHIFT		0
#define DFSDM1_DFSDM2_AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm1_dfsdm2_awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_awsr DFSDM2AWSR analog watchdog status register
@{*/


#define DFSDM1_DFSDM2_AWSR_AWHTF_SHIFT		8
#define DFSDM1_DFSDM2_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM2_AWSR_AWLTF_SHIFT		0
#define DFSDM1_DFSDM2_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_awcfr DFSDM2AWCFR analog watchdog clear flag register
@{*/


#define DFSDM1_DFSDM2_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM1_DFSDM2_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_DFSDM2_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM1_DFSDM2_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm1_dfsdm2_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_exmax DFSDM2EXMAX Extremes detector maximum register
@{*/


#define DFSDM1_DFSDM2_EXMAX_EXMAX_SHIFT		8
#define DFSDM1_DFSDM2_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM1_DFSDM2_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM1_DFSDM2_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_exmin DFSDM2EXMIN Extremes detector minimum register
@{*/


#define DFSDM1_DFSDM2_EXMIN_EXMIN_SHIFT		8
#define DFSDM1_DFSDM2_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm1_dfsdm2_exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM1_DFSDM2_EXMIN_EXMINCH_SHIFT		0
#define DFSDM1_DFSDM2_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm2_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm2_cnvtimr DFSDM2CNVTIMR conversion timer register
@{*/


#define DFSDM1_DFSDM2_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM1_DFSDM2_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm1_dfsdm2_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_dfsdm3_cr1 DFSDM3CR1 control register 1
@{*/

/** DFSDM1_DFSDM3_CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM1_DFSDM3_CR1_AWFSEL		(1 << 30)
/** DFSDM1_DFSDM3_CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM1_DFSDM3_CR1_FAST		(1 << 29)

#define DFSDM1_DFSDM3_CR1_RCH_SHIFT		24
#define DFSDM1_DFSDM3_CR1_RCH_MASK		0x07
/** @defgroup dfsdm1_dfsdm3_cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM1_DFSDM3_CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM1_DFSDM3_CR1_RDMAEN		(1 << 21)
/** DFSDM1_DFSDM3_CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM1_DFSDM3_CR1_RSYNC		(1 << 19)
/** DFSDM1_DFSDM3_CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM1_DFSDM3_CR1_RCONT		(1 << 18)
/** DFSDM1_DFSDM3_CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM1_DFSDM3_CR1_RSWSTART		(1 << 17)

